Revit 2016 API
ViewShapeBuilder.SetShape Method (DirectShape)
 Set a view-specific shape of the DirectShape object to geometry accumulated in this ViewShapeBuilder object. The view type currently set in ViewShapeBuilder is used. Since the accumulated geometry was validated by ViewShapeBuilder already, this skips the second validation in DirectShape. This function resets this ViewShapeBuilder object: the geometry is transferred to DirectShape, view normal and view type are invalidated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2015
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2016. Use DirectShape.SetShape(ShapeBuilder) instead.")]
public void SetShape(
	DirectShape directShape
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2016. Use DirectShape.SetShape(ShapeBuilder) instead.")> _
Public Sub SetShape ( _
	directShape As DirectShape _
)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2016. Use DirectShape.SetShape(ShapeBuilder) instead.")]
public:
void SetShape(
	DirectShape^ directShape
)
Parameters
directShape
Type: Autodesk.Revit.DB.DirectShape
 The DirectShape object that will have its view-specific shape representation set to a copy of geometry accumulated in this DirectShapeBuilder.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ViewShapeBuilder Class
SetShape Overload
Autodesk.Revit.DB Namespace